Tutorial_benchmark_1_with_2_interfaces/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         pimpleFoam;    // OpenFOAM v1806, OpenFOAM 6, or newer
// application         pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             50.0; //25

deltaT              0.01;//0.001

writeControl        adjustableRunTime;

writeInterval       0.01;//0.01

purgeWrite          0;

writeFormat         ascii;

writePrecision      12;//10

writeCompression    off;

timeFormat          general;

timePrecision       8;//12

//adjustTimeStep     yes;

//maxCo              0.5;

//maxDeltaT          0.01;

functions
{

    KratosOpenfoamAdapterFunctionObject1
    {
        type KratosOpenfoamAdapterFunctionObject;
        libs ("../KratosOpenfoamAdapterFunctionObject/libKratosOpenfoamAdapterFunctionObjectFunctionObjects.so");

        participant Fluid;
        dim 3;
        //thick 1;

        interfaces
        {
            Interface1
            {
                name                    interface_flap;
                patches                 (flap);
                importData              (Displacement0);
                importDataIdentifier    (disp_interface_flap);
                exportData              (Force0);
                exportDataIdentifier    (load_cells_interface_flap);
            }

            Interface2
            {
                //name                    interface_square_block;
                //patches                 (squareblock);
                //importData              (Displacement1);
                //importDataIdentifier    (disp_interface_square_block);
                //exportData              (Force1);
                //exportDataIdentifier    (load_cells_interface_square_block);

                name                    interface_square_block;
                patches                 (flap); //Testing purpose same geometry use with different name
                importData              (Displacement1);
                importDataIdentifier    (disp_interface_square_block);
                exportData              (Force1);
                exportDataIdentifier    (load_cells_interface_square_block);
            }
        }

        Parameters
        {
            rho rho [1 -3 0 0 0 0 0] 0.00118;
            nu nu [0 2 -1 0 0 0 0 ] 0.1542;
        }
    }

    Co1
    {
        type                CourantNo;
        libs                ("libfieldFunctionObjects.so");
        executeControl      timeStep;
        executeInterval     2;
        writeControl        writeTime;
    }

    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        patches             (flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              1.18;//0.00118//1000
        CofR                (0 0 0);
    }

    //- To see the residual plots
    //foamMonitor -l ./postProcessing/residuals/0/residuals.dat
    #includeFunc residuals

    // TO plot the displacements of the flap
    // Chosse the flap-tip position manually. - > (9.45 6.05 0.0)
    #includeFunc probes

}


// ************************************************************************* //
