Tutorial_benchmark_1_with_2_interfaces/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
    {
        default backward;
        //default Euler;
    }

    gradSchemes
    {
        //default     cellMDLimited Gauss linear 0.5;
        default     cellMDLimited leastSquares 1.0;
    }

    divSchemes
    {
        default         none;
    	div(phi,U)      Gauss linearUpwind grad(U);
        div((nuEff*dev2(T(grad(U))))) Gauss linear;
    }

    interpolationSchemes
    {
        default     linear;
    }

    laplacianSchemes
    {
        //default     Gauss linear limited 1.0;
        default     Gauss linear limited 0.5;
    }

    snGradSchemes
    {
        //default     limited 1.0;
        default     limited 0.5;

    }

    wallDist
    {
        method meshWave;
    }

    fluxRequired
    {
        default no;
        p ;
        pcorr;
        Phi ;
    }